system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0 -0.5 -0.5)
    (10 -0.5 -0.5)
    (10 0.5 -0.5)
    (0 0.5 -0.5)
    (0 -0.5 0.5)
    (10 -0.5 0.5)
    (10 0.5 0.5)
    (0 0.5 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 10 10) simpleGrading (1 1 1)
);

edges
();

boundary
(
    inlet
    {
        type mappedPatch;
        offset          (0.02 0 0);
        sampleMode      nearestCell;
//        type patch;
        faces
        (
            (0 4 7 3)  //inlet
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)  //outlet
        );
    }

    walls_top
    {
        type wall;
        faces
        (
            (3 7 6 2)  //top
        );
    }

    walls_bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)  //bottom
        );
    }

    walls_back
    {
        type wall;
        faces
        (
            (0 3 2 1)  //back
        );
    }
    walls_front
    {
        type wall;
        faces
        (
            (4 5 6 7)  //front
        );
    }
);


// ************************************************************************* //
