0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

inletValue      (0.1 0 0);

internalField   uniform $inletValue;

boundaryField
{
    inlet
    {
        type                mapped;
        value               uniform $inletValue;
        interpolationScheme cell;
        setAverage          true;
        average             $inletValue;

//        type            fixedValue;
//        value           uniform $inletValue;
    }

    outlet
    {
        type            zeroGradient;
    }

    "walls_.*"
    {
        type            noSlip;
    }

    "baffles_.*"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
