Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

touch case.foam
runApplication blockMesh
#python3 baffle.py
#runApplication snappyHexMesh #-overwrite
runApplication $(getApplication)
#------------------------------------------------------------------------------
